---
kind: property
id: P:Autodesk.Revit.DB.DocumentVersion.NumberOfSaves
source: html/27570649-19b7-6906-f25a-b6182bb02e03.htm
---
# Autodesk.Revit.DB.DocumentVersion.NumberOfSaves Property

The number of times the document has been saved. The save number and GUID
 are both necessary to uniquely identify a document version.

## Syntax (C#)
```csharp
public int NumberOfSaves { get; }
```